{
	"version": "1.0",
	"truncation": null,
	"padding": null,
	"added_tokens": [
		{
			"id": 0,
			"content": "<bos>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": false,
			"special": true
		},
		{
			"id": 1,
			"content": "<eos>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": false,
			"special": true
		},
		{
			"id": 2,
			"content": "<pad>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": false,
			"special": true
		},
		{
			"id": 3,
			"content": "<unk>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": false,
			"special": true
		},
		{
			"id": 4,
			"content": "<mask>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": false,
			"special": true
		},
		{
			"id": 5,
			"content": "<0x00>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 6,
			"content": "<0x01>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 7,
			"content": "<0x02>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 8,
			"content": "<0x03>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 9,
			"content": "<0x04>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 10,
			"content": "<0x05>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 11,
			"content": "<0x06>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 12,
			"content": "<0x07>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 13,
			"content": "<0x08>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 14,
			"content": "<0x09>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 15,
			"content": "<0x0A>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 16,
			"content": "<0x0B>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 17,
			"content": "<0x0C>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 18,
			"content": "<0x0D>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 19,
			"content": "<0x0E>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 20,
			"content": "<0x0F>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 21,
			"content": "<0x10>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 22,
			"content": "<0x11>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 23,
			"content": "<0x12>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 24,
			"content": "<0x13>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 25,
			"content": "<0x14>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 26,
			"content": "<0x15>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 27,
			"content": "<0x16>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 28,
			"content": "<0x17>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 29,
			"content": "<0x18>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 30,
			"content": "<0x19>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 31,
			"content": "<0x1A>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 32,
			"content": "<0x1B>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 33,
			"content": "<0x1C>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 34,
			"content": "<0x1D>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 35,
			"content": "<0x1E>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 36,
			"content": "<0x1F>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 37,
			"content": "<0x20>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 38,
			"content": "<0x21>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 39,
			"content": "<0x22>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 40,
			"content": "<0x23>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 41,
			"content": "<0x24>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 42,
			"content": "<0x25>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 43,
			"content": "<0x26>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 44,
			"content": "<0x27>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 45,
			"content": "<0x28>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 46,
			"content": "<0x29>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 47,
			"content": "<0x2A>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 48,
			"content": "<0x2B>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 49,
			"content": "<0x2C>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 50,
			"content": "<0x2D>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 51,
			"content": "<0x2E>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 52,
			"content": "<0x2F>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 53,
			"content": "<0x30>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 54,
			"content": "<0x31>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 55,
			"content": "<0x32>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 56,
			"content": "<0x33>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 57,
			"content": "<0x34>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 58,
			"content": "<0x35>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 59,
			"content": "<0x36>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 60,
			"content": "<0x37>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 61,
			"content": "<0x38>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 62,
			"content": "<0x39>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 63,
			"content": "<0x3A>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 64,
			"content": "<0x3B>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 65,
			"content": "<0x3C>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 66,
			"content": "<0x3D>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 67,
			"content": "<0x3E>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 68,
			"content": "<0x3F>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 69,
			"content": "<0x40>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 70,
			"content": "<0x41>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 71,
			"content": "<0x42>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 72,
			"content": "<0x43>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 73,
			"content": "<0x44>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 74,
			"content": "<0x45>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 75,
			"content": "<0x46>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 76,
			"content": "<0x47>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 77,
			"content": "<0x48>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 78,
			"content": "<0x49>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 79,
			"content": "<0x4A>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 80,
			"content": "<0x4B>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 81,
			"content": "<0x4C>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 82,
			"content": "<0x4D>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 83,
			"content": "<0x4E>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 84,
			"content": "<0x4F>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 85,
			"content": "<0x50>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 86,
			"content": "<0x51>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 87,
			"content": "<0x52>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 88,
			"content": "<0x53>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 89,
			"content": "<0x54>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 90,
			"content": "<0x55>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 91,
			"content": "<0x56>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 92,
			"content": "<0x57>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 93,
			"content": "<0x58>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 94,
			"content": "<0x59>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 95,
			"content": "<0x5A>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 96,
			"content": "<0x5B>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 97,
			"content": "<0x5C>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 98,
			"content": "<0x5D>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 99,
			"content": "<0x5E>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 100,
			"content": "<0x5F>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 101,
			"content": "<0x60>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 102,
			"content": "<0x61>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 103,
			"content": "<0x62>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 104,
			"content": "<0x63>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 105,
			"content": "<0x64>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 106,
			"content": "<0x65>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 107,
			"content": "<0x66>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 108,
			"content": "<0x67>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 109,
			"content": "<0x68>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 110,
			"content": "<0x69>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 111,
			"content": "<0x6A>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 112,
			"content": "<0x6B>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 113,
			"content": "<0x6C>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 114,
			"content": "<0x6D>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 115,
			"content": "<0x6E>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 116,
			"content": "<0x6F>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 117,
			"content": "<0x70>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 118,
			"content": "<0x71>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 119,
			"content": "<0x72>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 120,
			"content": "<0x73>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 121,
			"content": "<0x74>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 122,
			"content": "<0x75>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 123,
			"content": "<0x76>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 124,
			"content": "<0x77>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 125,
			"content": "<0x78>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 126,
			"content": "<0x79>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 127,
			"content": "<0x7A>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 128,
			"content": "<0x7B>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 129,
			"content": "<0x7C>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 130,
			"content": "<0x7D>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 131,
			"content": "<0x7E>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 132,
			"content": "<0x7F>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 133,
			"content": "<0x80>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 134,
			"content": "<0x81>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 135,
			"content": "<0x82>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 136,
			"content": "<0x83>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 137,
			"content": "<0x84>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 138,
			"content": "<0x85>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 139,
			"content": "<0x86>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 140,
			"content": "<0x87>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 141,
			"content": "<0x88>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 142,
			"content": "<0x89>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 143,
			"content": "<0x8A>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 144,
			"content": "<0x8B>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 145,
			"content": "<0x8C>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 146,
			"content": "<0x8D>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 147,
			"content": "<0x8E>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 148,
			"content": "<0x8F>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 149,
			"content": "<0x90>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 150,
			"content": "<0x91>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 151,
			"content": "<0x92>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 152,
			"content": "<0x93>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 153,
			"content": "<0x94>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 154,
			"content": "<0x95>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 155,
			"content": "<0x96>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 156,
			"content": "<0x97>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 157,
			"content": "<0x98>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 158,
			"content": "<0x99>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 159,
			"content": "<0x9A>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 160,
			"content": "<0x9B>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 161,
			"content": "<0x9C>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 162,
			"content": "<0x9D>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 163,
			"content": "<0x9E>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 164,
			"content": "<0x9F>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 165,
			"content": "<0xA0>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 166,
			"content": "<0xA1>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 167,
			"content": "<0xA2>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 168,
			"content": "<0xA3>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 169,
			"content": "<0xA4>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 170,
			"content": "<0xA5>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 171,
			"content": "<0xA6>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 172,
			"content": "<0xA7>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 173,
			"content": "<0xA8>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 174,
			"content": "<0xA9>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 175,
			"content": "<0xAA>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 176,
			"content": "<0xAB>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 177,
			"content": "<0xAC>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 178,
			"content": "<0xAD>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 179,
			"content": "<0xAE>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 180,
			"content": "<0xAF>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 181,
			"content": "<0xB0>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 182,
			"content": "<0xB1>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 183,
			"content": "<0xB2>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 184,
			"content": "<0xB3>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 185,
			"content": "<0xB4>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 186,
			"content": "<0xB5>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 187,
			"content": "<0xB6>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 188,
			"content": "<0xB7>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 189,
			"content": "<0xB8>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 190,
			"content": "<0xB9>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 191,
			"content": "<0xBA>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 192,
			"content": "<0xBB>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 193,
			"content": "<0xBC>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 194,
			"content": "<0xBD>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 195,
			"content": "<0xBE>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 196,
			"content": "<0xBF>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 197,
			"content": "<0xC0>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 198,
			"content": "<0xC1>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 199,
			"content": "<0xC2>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 200,
			"content": "<0xC3>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 201,
			"content": "<0xC4>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 202,
			"content": "<0xC5>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 203,
			"content": "<0xC6>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 204,
			"content": "<0xC7>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 205,
			"content": "<0xC8>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 206,
			"content": "<0xC9>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 207,
			"content": "<0xCA>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 208,
			"content": "<0xCB>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 209,
			"content": "<0xCC>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 210,
			"content": "<0xCD>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 211,
			"content": "<0xCE>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 212,
			"content": "<0xCF>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 213,
			"content": "<0xD0>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 214,
			"content": "<0xD1>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 215,
			"content": "<0xD2>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 216,
			"content": "<0xD3>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 217,
			"content": "<0xD4>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 218,
			"content": "<0xD5>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 219,
			"content": "<0xD6>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 220,
			"content": "<0xD7>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 221,
			"content": "<0xD8>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 222,
			"content": "<0xD9>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 223,
			"content": "<0xDA>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 224,
			"content": "<0xDB>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 225,
			"content": "<0xDC>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 226,
			"content": "<0xDD>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 227,
			"content": "<0xDE>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 228,
			"content": "<0xDF>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 229,
			"content": "<0xE0>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 230,
			"content": "<0xE1>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 231,
			"content": "<0xE2>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 232,
			"content": "<0xE3>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 233,
			"content": "<0xE4>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 234,
			"content": "<0xE5>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 235,
			"content": "<0xE6>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 236,
			"content": "<0xE7>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 237,
			"content": "<0xE8>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 238,
			"content": "<0xE9>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 239,
			"content": "<0xEA>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 240,
			"content": "<0xEB>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 241,
			"content": "<0xEC>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 242,
			"content": "<0xED>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 243,
			"content": "<0xEE>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 244,
			"content": "<0xEF>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 245,
			"content": "<0xF0>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 246,
			"content": "<0xF1>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 247,
			"content": "<0xF2>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 248,
			"content": "<0xF3>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 249,
			"content": "<0xF4>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 250,
			"content": "<0xF5>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 251,
			"content": "<0xF6>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 252,
			"content": "<0xF7>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 253,
			"content": "<0xF8>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 254,
			"content": "<0xF9>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 255,
			"content": "<0xFA>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 256,
			"content": "<0xFB>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 257,
			"content": "<0xFC>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 258,
			"content": "<0xFD>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 259,
			"content": "<0xFE>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		},
		{
			"id": 260,
			"content": "<0xFF>",
			"single_word": false,
			"lstrip": false,
			"rstrip": false,
			"normalized": true,
			"special": false
		}
	],
	"normalizer": {
		"type": "Sequence",
		"normalizers": [
			{
				"type": "Strip",
				"strip_left": true,
				"strip_right": true
			},
			{
				"type": "NFC"
			}
		]
	},
	"pre_tokenizer": {
		"type": "Sequence",
		"pretokenizers": [
			{
				"type": "Split",
				"pattern": {
					"Regex": "[^\\x{4E00}-\\x{9FFF}\\x{3400}-\\x{4DBF}\\x{F900}-\\x{FAFF}\\x{20000}-\\x{2A6DF}]"
				},
				"behavior": "Isolated",
				"invert": false
			}
		]
	},
	"post_processor": null,
	"decoder": {
		"type": "Sequence",
		"decoders": [
			{
				"type": "ByteFallback"
			},
			{
				"type": "Fuse"
			}
		]
	},
	"model": {
		"type": "BPE",
		"dropout": null,
		"unk_token": "<unk>",
		"continuing_subword_prefix": null,
		"end_of_word_suffix": null,
		"fuse_unk": false,
		"byte_fallback": true,
		"ignore_merges": false,
		"vocab": {
			"<bos>": 0,
			"<eos>": 1,
			"<pad>": 2,
			"<unk>": 3,
			"<mask>": 4,
			"<0x00>": 5,
			"<0x01>": 6,
			"<0x02>": 7,
			"<0x03>": 8,
			"<0x04>": 9,
			"<0x05>": 10,
			"<0x06>": 11,
			"<0x07>": 12,
			"<0x08>": 13,
			"<0x09>": 14,
			"<0x0A>": 15,
			"<0x0B>": 16,
			"<0x0C>": 17,
			"<0x0D>": 18,
			"<0x0E>": 19,
			"<0x0F>": 20,
			"<0x10>": 21,
			"<0x11>": 22,
			"<0x12>": 23,
			"<0x13>": 24,
			"<0x14>": 25,
			"<0x15>": 26,
			"<0x16>": 27,
			"<0x17>": 28,
			"<0x18>": 29,
			"<0x19>": 30,
			"<0x1A>": 31,
			"<0x1B>": 32,
			"<0x1C>": 33,
			"<0x1D>": 34,
			"<0x1E>": 35,
			"<0x1F>": 36,
			"<0x20>": 37,
			"<0x21>": 38,
			"<0x22>": 39,
			"<0x23>": 40,
			"<0x24>": 41,
			"<0x25>": 42,
			"<0x26>": 43,
			"<0x27>": 44,
			"<0x28>": 45,
			"<0x29>": 46,
			"<0x2A>": 47,
			"<0x2B>": 48,
			"<0x2C>": 49,
			"<0x2D>": 50,
			"<0x2E>": 51,
			"<0x2F>": 52,
			"<0x30>": 53,
			"<0x31>": 54,
			"<0x32>": 55,
			"<0x33>": 56,
			"<0x34>": 57,
			"<0x35>": 58,
			"<0x36>": 59,
			"<0x37>": 60,
			"<0x38>": 61,
			"<0x39>": 62,
			"<0x3A>": 63,
			"<0x3B>": 64,
			"<0x3C>": 65,
			"<0x3D>": 66,
			"<0x3E>": 67,
			"<0x3F>": 68,
			"<0x40>": 69,
			"<0x41>": 70,
			"<0x42>": 71,
			"<0x43>": 72,
			"<0x44>": 73,
			"<0x45>": 74,
			"<0x46>": 75,
			"<0x47>": 76,
			"<0x48>": 77,
			"<0x49>": 78,
			"<0x4A>": 79,
			"<0x4B>": 80,
			"<0x4C>": 81,
			"<0x4D>": 82,
			"<0x4E>": 83,
			"<0x4F>": 84,
			"<0x50>": 85,
			"<0x51>": 86,
			"<0x52>": 87,
			"<0x53>": 88,
			"<0x54>": 89,
			"<0x55>": 90,
			"<0x56>": 91,
			"<0x57>": 92,
			"<0x58>": 93,
			"<0x59>": 94,
			"<0x5A>": 95,
			"<0x5B>": 96,
			"<0x5C>": 97,
			"<0x5D>": 98,
			"<0x5E>": 99,
			"<0x5F>": 100,
			"<0x60>": 101,
			"<0x61>": 102,
			"<0x62>": 103,
			"<0x63>": 104,
			"<0x64>": 105,
			"<0x65>": 106,
			"<0x66>": 107,
			"<0x67>": 108,
			"<0x68>": 109,
			"<0x69>": 110,
			"<0x6A>": 111,
			"<0x6B>": 112,
			"<0x6C>": 113,
			"<0x6D>": 114,
			"<0x6E>": 115,
			"<0x6F>": 116,
			"<0x70>": 117,
			"<0x71>": 118,
			"<0x72>": 119,
			"<0x73>": 120,
			"<0x74>": 121,
			"<0x75>": 122,
			"<0x76>": 123,
			"<0x77>": 124,
			"<0x78>": 125,
			"<0x79>": 126,
			"<0x7A>": 127,
			"<0x7B>": 128,
			"<0x7C>": 129,
			"<0x7D>": 130,
			"<0x7E>": 131,
			"<0x7F>": 132,
			"<0x80>": 133,
			"<0x81>": 134,
			"<0x82>": 135,
			"<0x83>": 136,
			"<0x84>": 137,
			"<0x85>": 138,
			"<0x86>": 139,
			"<0x87>": 140,
			"<0x88>": 141,
			"<0x89>": 142,
			"<0x8A>": 143,
			"<0x8B>": 144,
			"<0x8C>": 145,
			"<0x8D>": 146,
			"<0x8E>": 147,
			"<0x8F>": 148,
			"<0x90>": 149,
			"<0x91>": 150,
			"<0x92>": 151,
			"<0x93>": 152,
			"<0x94>": 153,
			"<0x95>": 154,
			"<0x96>": 155,
			"<0x97>": 156,
			"<0x98>": 157,
			"<0x99>": 158,
			"<0x9A>": 159,
			"<0x9B>": 160,
			"<0x9C>": 161,
			"<0x9D>": 162,
			"<0x9E>": 163,
			"<0x9F>": 164,
			"<0xA0>": 165,
			"<0xA1>": 166,
			"<0xA2>": 167,
			"<0xA3>": 168,
			"<0xA4>": 169,
			"<0xA5>": 170,
			"<0xA6>": 171,
			"<0xA7>": 172,
			"<0xA8>": 173,
			"<0xA9>": 174,
			"<0xAA>": 175,
			"<0xAB>": 176,
			"<0xAC>": 177,
			"<0xAD>": 178,
			"<0xAE>": 179,
			"<0xAF>": 180,
			"<0xB0>": 181,
			"<0xB1>": 182,
			"<0xB2>": 183,
			"<0xB3>": 184,
			"<0xB4>": 185,
			"<0xB5>": 186,
			"<0xB6>": 187,
			"<0xB7>": 188,
			"<0xB8>": 189,
			"<0xB9>": 190,
			"<0xBA>": 191,
			"<0xBB>": 192,
			"<0xBC>": 193,
			"<0xBD>": 194,
			"<0xBE>": 195,
			"<0xBF>": 196,
			"<0xC0>": 197,
			"<0xC1>": 198,
			"<0xC2>": 199,
			"<0xC3>": 200,
			"<0xC4>": 201,
			"<0xC5>": 202,
			"<0xC6>": 203,
			"<0xC7>": 204,
			"<0xC8>": 205,
			"<0xC9>": 206,
			"<0xCA>": 207,
			"<0xCB>": 208,
			"<0xCC>": 209,
			"<0xCD>": 210,
			"<0xCE>": 211,
			"<0xCF>": 212,
			"<0xD0>": 213,
			"<0xD1>": 214,
			"<0xD2>": 215,
			"<0xD3>": 216,
			"<0xD4>": 217,
			"<0xD5>": 218,
			"<0xD6>": 219,
			"<0xD7>": 220,
			"<0xD8>": 221,
			"<0xD9>": 222,
			"<0xDA>": 223,
			"<0xDB>": 224,
			"<0xDC>": 225,
			"<0xDD>": 226,
			"<0xDE>": 227,
			"<0xDF>": 228,
			"<0xE0>": 229,
			"<0xE1>": 230,
			"<0xE2>": 231,
			"<0xE3>": 232,
			"<0xE4>": 233,
			"<0xE5>": 234,
			"<0xE6>": 235,
			"<0xE7>": 236,
			"<0xE8>": 237,
			"<0xE9>": 238,
			"<0xEA>": 239,
			"<0xEB>": 240,
			"<0xEC>": 241,
			"<0xED>": 242,
			"<0xEE>": 243,
			"<0xEF>": 244,
			"<0xF0>": 245,
			"<0xF1>": 246,
			"<0xF2>": 247,
			"<0xF3>": 248,
			"<0xF4>": 249,
			"<0xF5>": 250,
			"<0xF6>": 251,
			"<0xF7>": 252,
			"<0xF8>": 253,
			"<0xF9>": 254,
			"<0xFA>": 255,
			"<0xFB>": 256,
			"<0xFC>": 257,
			"<0xFD>": 258,
			"<0xFE>": 259,
			"<0xFF>": 260,
			" ": 261,
			"!": 262,
			"\"": 263,
			"#": 264,
			"$": 265,
			"%": 266,
			"&": 267,
			"'": 268,
			"(": 269,
			")": 270,
			"*": 271,
			"+": 272,
			",": 273,
			"-": 274,
			".": 275,
			"/": 276,
			"0": 277,
			"1": 278,
			"2": 279,
			"3": 280,
			"4": 281,
			"5": 282,
			"6": 283,
			"7": 284,
			"8": 285,
			"9": 286,
			":": 287,
			";": 288,
			"=": 289,
			"?": 290,
			"@": 291,
			"A": 292,
			"B": 293,
			"C": 294,
			"D": 295,
			"E": 296,
			"F": 297,
			"G": 298,
			"H": 299,
			"I": 300,
			"J": 301,
			"K": 302,
			"L": 303,
			"M": 304,
			"N": 305,
			"O": 306,
			"P": 307,
			"Q": 308,
			"R": 309,
			"S": 310,
			"T": 311,
			"U": 312,
			"V": 313,
			"W": 314,
			"X": 315,
			"Y": 316,
			"Z": 317,
			"[": 318,
			"\\": 319,
			"]": 320,
			"^": 321,
			"_": 322,
			"a": 323,
			"b": 324,
			"c": 325,
			"d": 326,
			"e": 327,
			"f": 328,
			"g": 329,
			"h": 330,
			"i": 331,
			"j": 332,
			"k": 333,
			"l": 334,
			"m": 335,
			"n": 336,
			"o": 337,
			"p": 338,
			"q": 339,
			"r": 340,
			"s": 341,
			"t": 342,
			"u": 343,
			"v": 344,
			"w": 345,
			"x": 346,
			"y": 347,
			"z": 348,
			"{": 349,
			"|": 350,
			"}": 351,
			"~": 352,
			" ": 353,
			"«": 354,
			"°": 355,
			"±": 356,
			"²": 357,
			"³": 358,
			"·": 359,
			"»": 360,
			"Å": 361,
			"É": 362,
			"×": 363,
			"à": 364,
			"á": 365,
			"â": 366,
			"ä": 367,
			"ç": 368,
			"è": 369,
			"é": 370,
			"í": 371,
			"ñ": 372,
			"ó": 373,
			"ö": 374,
			"ú": 375,
			"ü": 376,
			"ā": 377,
			"ŋ": 378,
			"ō": 379,
			"š": 380,
			"ə": 381,
			"ʰ": 382,
			"Δ": 383,
			"α": 384,
			"β": 385,
			"γ": 386,
			"δ": 387,
			"ε": 388,
			"η": 389,
			"θ": 390,
			"ι": 391,
			"κ": 392,
			"λ": 393,
			"μ": 394,
			"ν": 395,
			"ο": 396,
			"π": 397,
			"ρ": 398,
			"ς": 399,
			"σ": 400,
			"τ": 401,
			"φ": 402,
			"ω": 403,
			"С": 404,
			"а": 405,
			"б": 406,
			"в": 407,
			"г": 408,
			"д": 409,
			"е": 410,
			"з": 411,
			"и": 412,
			"й": 413,
			"к": 414,
			"л": 415,
			"м": 416,
			"н": 417,
			"о": 418,
			"п": 419,
			"р": 420,
			"с": 421,
			"т": 422,
			"у": 423,
			"ы": 424,
			"ь": 425,
			"я": 426,
			"ا": 427,
			"ل": 428,
			"་": 429,
			"​": 430,
			"–": 431,
			"—": 432,
			"―": 433,
			"‘": 434,
			"’": 435,
			"“": 436,
			"”": 437,
			"†": 438,
			"•": 439,
			"…": 440,
			"‧": 441,
			"‰": 442,
			"′": 443,
			"″": 444,
			"※": 445,
			"⁄": 446,
			"℃": 447,
			"Ⅰ": 448,
			"Ⅱ": 449,
			"Ⅲ": 450,
			"←": 451,
			"↑": 452,
			"→": 453,
			"−": 454,
			"≤": 455,
			"⋯": 456,
			"─": 457,
			"│": 458,
			"■": 459,
			"□": 460,
			"○": 461,
			"●": 462,
			"★": 463,
			"☆": 464,
			"⟨": 465,
			"⟩": 466,
			"　": 467,
			"、": 468,
			"。": 469,
			"〇": 470,
			"〈": 471,
			"〉": 472,
			"《": 473,
			"》": 474,
			"「": 475,
			"」": 476,
			"『": 477,
			"』": 478,
			"【": 479,
			"】": 480,
			"〔": 481,
			"〕": 482,
			"〜": 483,
			"あ": 484,
			"い": 485,
			"う": 486,
			"え": 487,
			"お": 488,
			"か": 489,
			"が": 490,
			"き": 491,
			"く": 492,
			"け": 493,
			"こ": 494,
			"さ": 495,
			"し": 496,
			"じ": 497,
			"す": 498,
			"そ": 499,
			"た": 500,
			"だ": 501,
			"ち": 502,
			"っ": 503,
			"つ": 504,
			"て": 505,
			"で": 506,
			"と": 507,
			"ど": 508,
			"な": 509,
			"に": 510,
			"の": 511,
			"は": 512,
			"ひ": 513,
			"ま": 514,
			"み": 515,
			"め": 516,
			"も": 517,
			"ゃ": 518,
			"や": 519,
			"ゆ": 520,
			"よ": 521,
			"ら": 522,
			"り": 523,
			"る": 524,
			"れ": 525,
			"ろ": 526,
			"わ": 527,
			"を": 528,
			"ん": 529,
			"ァ": 530,
			"ア": 531,
			"ィ": 532,
			"イ": 533,
			"ウ": 534,
			"ェ": 535,
			"エ": 536,
			"オ": 537,
			"カ": 538,
			"ガ": 539,
			"キ": 540,
			"ク": 541,
			"グ": 542,
			"ケ": 543,
			"コ": 544,
			"サ": 545,
			"シ": 546,
			"ジ": 547,
			"ス": 548,
			"ズ": 549,
			"セ": 550,
			"タ": 551,
			"ダ": 552,
			"チ": 553,
			"ッ": 554,
			"ツ": 555,
			"テ": 556,
			"デ": 557,
			"ト": 558,
			"ド": 559,
			"ナ": 560,
			"ニ": 561,
			"ネ": 562,
			"ノ": 563,
			"ハ": 564,
			"バ": 565,
			"パ": 566,
			"ビ": 567,
			"フ": 568,
			"ブ": 569,
			"プ": 570,
			"ボ": 571,
			"マ": 572,
			"ミ": 573,
			"ム": 574,
			"メ": 575,
			"モ": 576,
			"ャ": 577,
			"ュ": 578,
			"ョ": 579,
			"ラ": 580,
